## Production: database-tools
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                     |
|----------|----------------------------------------------|
| delete   | `aws_ssm_parameter.blazer_slack_webhook_url` |
| update   | `aws_ecs_service.blazer`                     |
| recreate | `aws_ecs_task_definition.blazer`             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.blazer will be updated in-place
  ~ resource "aws_ecs_service" "blazer" {
        id                                 = "arn:aws:ecs:ca-central-1:296255494825:service/blazer/blazer"
        name                               = "blazer"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:296255494825:task-definition/blazer:9" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.blazer must be replaced
-/+ resource "aws_ecs_task_definition" "blazer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:296255494825:task-definition/blazer:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:296255494825:task-definition/blazer" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints      = []
                    name             = "blazer"
                  ~ secrets          = [
                        # (1 unchanged element hidden)
                        {
                            name      = "DATABASE_URL"
                            valueFrom = "arn:aws:ssm:ca-central-1:296255494825:parameter/BLAZER_DATABASE_URL"
                        },
                      - {
                          - name      = "BLAZER_SLACK_WEBHOOK_URL"
                          - valueFrom = "arn:aws:ssm:ca-central-1:296255494825:parameter/BLAZER_SLACK_WEBHOOK_URL"
                        },
                        {
                            name      = "GOOGLE_OAUTH_CLIENT_ID"
                            valueFrom = "arn:aws:ssm:ca-central-1:296255494825:parameter/notify_o11y_google_oauth_client_id"
                        },
                        # (1 unchanged element hidden)
                    ]
                  - volumesFrom      = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "blazer" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.blazer_slack_webhook_url will be destroyed
  # (because aws_ssm_parameter.blazer_slack_webhook_url is not in configuration)
  - resource "aws_ssm_parameter" "blazer_slack_webhook_url" {
      - arn       = "arn:aws:ssm:ca-central-1:296255494825:parameter/BLAZER_SLACK_WEBHOOK_URL" -> null
      - data_type = "text" -> null
      - id        = "BLAZER_SLACK_WEBHOOK_URL" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "BLAZER_SLACK_WEBHOOK_URL" -> null
      - tags      = {
          - "CostCenter" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all  = {
          - "CostCenter" = "notification-canada-ca-production"
          - "Terraform"  = "true"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

Plan: 1 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.database-tools"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.database-tools-rds-subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_exection_role_parameter_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_task_role_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.db_tools_environment_variables"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.sqlalchemy_database_reader_uri"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
